<h1>Imputation</h1>
 <h3>1. Simple Imputation</h3>

**1-Importing Essential Libraries**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.impute import SimpleImputer

_2- reading .csv file._

In [2]:
data=pd.read_csv("missing-data.csv")

_3- looking at first five row of dataset._

In [3]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

_4- descriptive statistics of dataset._

In [4]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
Age,10.0,38.5,7.306770,27.0,35.25,37.5,43.0,50.0
Salary,10.0,63900.0,11570.556503,48000.0,55000.00,63000.0,70750.0,83000.0

_5- counting total number of null values in each attributes of dataset._

In [5]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

_6- using mean strategy to impute the missing values with SimpleImputer class._

In [6]:
imp=SimpleImputer(missing_values=np.NaN)
imp = imp.fit(data.iloc[:, 1:3])
data.iloc[:, 1:3] = imp.transform(data.iloc[:, 1:3])
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63900.0       Yes

_7- final dataset with no missing values_

In [7]:
data.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

<h5>Thank you</h5>